tests/Chisel.Tests/DependencyGraphTest.MongoDbGraph_writeIgnoredPackages=True_format=graphviz.verified.gv
# Generated by https://github.com/0xced/Chisel

digraph
{
  rankdir=LR
  node [ fontname = "Segoe UI, sans-serif", shape = box, style = filled, fillcolor = aquamarine, color = "#009061", fontcolor = "#333333" ]

  "AWSSDK.SecurityToken" -> "AWSSDK.Core"
  "DnsClient" -> "Microsoft.Win32.Registry"
  "Docker.DotNet" -> "Newtonsoft.Json"
  "Docker.DotNet.X509" -> "Docker.DotNet"
  "Microsoft.Extensions.Logging.Abstractions" -> "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Win32.Registry" -> "System.Security.AccessControl"
  "Microsoft.Win32.Registry" -> "System.Security.Principal.Windows"
  "MongoDB.Bson" -> "System.Runtime.CompilerServices.Unsafe"
  "MongoDB.Driver" -> "Microsoft.Extensions.Logging.Abstractions"
  "MongoDB.Driver" -> "MongoDB.Bson"
  "MongoDB.Driver" -> "MongoDB.Driver.Core"
  "MongoDB.Driver" -> "MongoDB.Libmongocrypt"
  "MongoDB.Driver.Core" -> "AWSSDK.SecurityToken"
  "MongoDB.Driver.Core" -> "DnsClient"
  "MongoDB.Driver.Core" -> "Microsoft.Extensions.Logging.Abstractions"
  "MongoDB.Driver.Core" -> "MongoDB.Bson"
  "MongoDB.Driver.Core" -> "MongoDB.Libmongocrypt"
  "MongoDB.Driver.Core" -> "SharpCompress"
  "MongoDB.Driver.Core" -> "Snappier"
  "MongoDB.Driver.Core" -> "ZstdSharp.Port"
  "SSH.NET" -> "SshNet.Security.Cryptography"
  "System.Security.AccessControl" -> "System.Security.Principal.Windows"
  "System.Text.Encodings.Web" -> "System.Runtime.CompilerServices.Unsafe"
  "System.Text.Json" -> "System.Runtime.CompilerServices.Unsafe"
  "System.Text.Json" -> "System.Text.Encodings.Web"
  "Testcontainers" -> "BouncyCastle.Cryptography"
  "Testcontainers" -> "Docker.DotNet"
  "Testcontainers" -> "Docker.DotNet.X509"
  "Testcontainers" -> "Microsoft.Bcl.AsyncInterfaces"
  "Testcontainers" -> "Microsoft.Extensions.Logging.Abstractions"
  "Testcontainers" -> "SharpZipLib"
  "Testcontainers" -> "SSH.NET"
  "Testcontainers" -> "System.Text.Json"
  "Testcontainers.MongoDb" -> "Testcontainers"

  "AWSSDK.Core" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "AWSSDK.SecurityToken" [ fillcolor = lightcoral, color = "#A42A2A" ]
  "BouncyCastle.Cryptography" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "ByteSize"
  "DnsClient"
  "Docker.DotNet" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Docker.DotNet.X509" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Microsoft.Bcl.AsyncInterfaces" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Microsoft.Extensions.DependencyInjection.Abstractions"
  "Microsoft.Extensions.Logging.Abstractions"
  "Microsoft.Win32.Registry"
  "MongoDB.Bson"
  "MongoDB.Driver"
  "MongoDB.Driver.Core"
  "MongoDB.Libmongocrypt"
  "Newtonsoft.Json" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "SharpCompress"
  "SharpZipLib" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Snappier"
  "SSH.NET" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "SshNet.Security.Cryptography" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "System.Runtime.CompilerServices.Unsafe"
  "System.Security.AccessControl"
  "System.Security.Principal.Windows"
  "System.Text.Encodings.Web" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "System.Text.Json" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Testcontainers" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "Testcontainers.MongoDb" [ fillcolor = lightgray, color = "#7A7A7A" ]
  "ZstdSharp.Port"
}
