tests/Chisel.Tests/DependencyGraphTest.MongoDbGraph_writeIgnoredPackages=True_format=mermaid.verified.mmd
%% Generated by https://github.com/0xced/Chisel

graph LR

classDef default fill:aquamarine,stroke:#009061
classDef ignored fill:lightgray,stroke:#7A7A7A
classDef removed fill:lightcoral,stroke:#A42A2A

AWSSDK.SecurityToken --> AWSSDK.Core
ByteSize
DnsClient --> Microsoft.Win32.Registry
Docker.DotNet --> Newtonsoft.Json
Docker.DotNet.X509 --> Docker.DotNet
Microsoft.Extensions.Logging.Abstractions --> Microsoft.Extensions.DependencyInjection.Abstractions
Microsoft.Win32.Registry --> System.Security.AccessControl
Microsoft.Win32.Registry --> System.Security.Principal.Windows
MongoDB.Bson --> System.Runtime.CompilerServices.Unsafe
MongoDB.Driver --> Microsoft.Extensions.Logging.Abstractions
MongoDB.Driver --> MongoDB.Bson
MongoDB.Driver --> MongoDB.Driver.Core
MongoDB.Driver --> MongoDB.Libmongocrypt
MongoDB.Driver.Core --> AWSSDK.SecurityToken
MongoDB.Driver.Core --> DnsClient
MongoDB.Driver.Core --> Microsoft.Extensions.Logging.Abstractions
MongoDB.Driver.Core --> MongoDB.Bson
MongoDB.Driver.Core --> MongoDB.Libmongocrypt
MongoDB.Driver.Core --> SharpCompress
MongoDB.Driver.Core --> Snappier
MongoDB.Driver.Core --> ZstdSharp.Port
SSH.NET --> SshNet.Security.Cryptography
System.Security.AccessControl --> System.Security.Principal.Windows
System.Text.Encodings.Web --> System.Runtime.CompilerServices.Unsafe
System.Text.Json --> System.Runtime.CompilerServices.Unsafe
System.Text.Json --> System.Text.Encodings.Web
Testcontainers --> BouncyCastle.Cryptography
Testcontainers --> Docker.DotNet
Testcontainers --> Docker.DotNet.X509
Testcontainers --> Microsoft.Bcl.AsyncInterfaces
Testcontainers --> Microsoft.Extensions.Logging.Abstractions
Testcontainers --> SharpZipLib
Testcontainers --> SSH.NET
Testcontainers --> System.Text.Json
Testcontainers.MongoDb --> Testcontainers

class AWSSDK.Core removed
class AWSSDK.SecurityToken removed
class BouncyCastle.Cryptography ignored
class ByteSize default
class DnsClient default
class Docker.DotNet ignored
class Docker.DotNet.X509 ignored
class Microsoft.Bcl.AsyncInterfaces ignored
class Microsoft.Extensions.DependencyInjection.Abstractions default
class Microsoft.Extensions.Logging.Abstractions default
class Microsoft.Win32.Registry default
class MongoDB.Bson default
class MongoDB.Driver default
class MongoDB.Driver.Core default
class MongoDB.Libmongocrypt default
class Newtonsoft.Json ignored
class SharpCompress default
class SharpZipLib ignored
class Snappier default
class SSH.NET ignored
class SshNet.Security.Cryptography ignored
class System.Runtime.CompilerServices.Unsafe default
class System.Security.AccessControl default
class System.Security.Principal.Windows default
class System.Text.Encodings.Web ignored
class System.Text.Json ignored
class Testcontainers ignored
class Testcontainers.MongoDb ignored
class ZstdSharp.Port default
